Revit 2027 API
BuiltInFailures.MassFailures.NoCurtainRoofsInMassing Property
 Massing cannot be created with a curtain roof. Please change the default roof type and try again.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoCurtainRoofsInMassing { get; }
Public Shared ReadOnly Property NoCurtainRoofsInMassing As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoCurtainRoofsInMassing {
	FailureDefinitionId^ get ();
}
static member NoCurtainRoofsInMassing : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MassFailures Class
Autodesk.Revit.DB Namespace